In [10]:
# Pandas is an open source library built on top of NumPy
# It allows for fast analysis and data cleaning and preparation
# Series 
# DataFrames
# Missing Data
# GroupBy
# Merging, Joining, and Concatenating
import numpy as np
import pandas as pd

# 1. Series

In [18]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c': 30}

In [19]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [20]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [26]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser2 = pd.Series([1,2,5,4],['USA','Italy','USSR','Japan'])

In [28]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [29]:
ser2

USA      1
Italy    2
USSR     5
Japan    4
dtype: int64

In [30]:
ser1 + ser2

Germany    NaN
Italy      NaN
Japan      8.0
USA        2.0
USSR       8.0
dtype: float64

# 2. DataFrames

In [31]:
from numpy.random import randn

In [117]:
np.random.seed(101)

In [120]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [121]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [122]:
type(df['W'])

pandas.core.series.Series

In [123]:
type(df)

pandas.core.frame.DataFrame

In [124]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [126]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [129]:
df['new'] = df['W'] + df['Z']
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [130]:
df.drop('A')

          W         X         Y         Z       new
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [132]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [134]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [135]:
df.drop('new',axis=1,inplace=True)

In [136]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [137]:
df.shape

(5, 4)

In [138]:
df[['Z','X']]

          Z         X
A  0.000366  0.196800
B  0.649826 -0.156598
C -0.346419 -0.610259
D  1.024810 -0.479448
E  0.610478  1.862864

In [139]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [140]:
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [142]:
df.iloc[0]

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [143]:
df.loc['B','W']

1.025984152081572

In [146]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [147]:
df > 0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [148]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [149]:
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [152]:
df[(df['W']>0) & (df['Y'] > 0)]

          W         X         Y        Z
D  0.147027 -0.479448  0.558769  1.02481

In [153]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [162]:
df['states'] = ['AAA','BBB','CCC','DDD','EEE']

In [164]:
df.set_index('states')

               W         X         Y         Z
states
AAA    -0.993263  0.196800 -1.136645  0.000366
BBB     1.025984 -0.156598 -0.031579  0.649826
CCC     2.154846 -0.610259 -0.755325 -0.346419
DDD     0.147027 -0.479448  0.558769  1.024810
EEE    -0.925874  1.862864 -1.133817  0.610478